{
  "https://www.microsoft.com/developerblog/2019/01/18/running-parallel-apache-spark-notebook-workloads-on-azure-databricks/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2019/01/featured.png",
    "title": "Running Parallel Apache Spark Notebook Workloads On Azure Databricks - ISE Developer Blog",
    "description": "This article walks through the development of a technique for running Spark jobs in parallel on Azure Databricks. The technique enabled us to reduce the processing times for JetBlue's reporting threefold while keeping the business logic implementation straight forward. The technique can be re-used for any notebooks-based Spark workload on Azure Databricks."
  },
  "https://www.microsoft.com/developerblog/2018/05/17/using-otsus-method-generate-data-training-deep-learning-image-segmentation-models/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2018/05/featured.png",
    "title": "Using Otsu's method to generate data for training of deep learning image segmentation models - ISE Developer Blog",
    "description": "In this article, we introduce a technique to rapidly pre-label training data for image segmentation models such that annotators no longer have to painstakingly hand-annotate every pixel of interest in an image. The approach is implemented in Python and OpenCV and extensible to any image segmentation task that aims to identify a subset of visually distinct pixels in an image."
  },
  "https://www.microsoft.com/developerblog/2018/01/18/continuous-delivery-service-fabric-via-github-travis-ci-docker-compose/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2018/01/feature.png",
    "title": "Continuous Delivery for Service Fabric via Github, Travis CI and Docker Compose - ISE Developer Blog",
    "description": "This article describes how to use GitHub, Travis CI and Docker Compose to build a simple continuous delivery pipeline to deploy Linux Docker containers to a Service Fabric cluster of Linux hosts."
  },
  "https://www.microsoft.com/developerblog/2018/01/09/deploying-a-linux-python-web-application-to-service-fabric-via-docker-compose/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2018/01/feature-1.png",
    "title": "Deploying a Linux Python web application to Service Fabric via Docker Compose - ISE Developer Blog",
    "description": "This article covers how to take a standard Python web service consisting of an application tier, a WSGI server, and a Nginx reverse proxy and deploy it via Linux containers to a Linux cluster managed by Azure Service Fabric using only simple tooling like Docker Compose."
  },
  "https://www.microsoft.com/developerblog/2017/12/05/comparing-transfer-learning-systems-custom-vision-service-vs-inception-vs-mobilenet/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2017/12/featured.png",
    "title": "Comparing Image-Classification Systems: Custom Vision Service vs. Inception - ISE Developer Blog",
    "description": "This story covers how to get started with transfer-learning and build image classification models in Python with the Custom Vision Service. We compare the results with the popular Tensorflow-based models Inception and MobileNet."
  },
  "https://www.microsoft.com/developerblog/2017/11/20/opener-permissively-licensed-named-entity-recognition-on-the-jvm/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2017/11/featured.png",
    "title": "Permissively-Licensed Named Entity Recognition on the JVM - ISE Developer Blog",
    "description": "Named entity recognition using Spark Streaming and Scala. A solution based on Docker containers and Azure Web Apps for Linux."
  },
  "https://www.microsoft.com/developerblog/2017/11/01/building-a-custom-spark-connector-for-near-real-time-speech-to-text-transcription/": {
    "image": "https://devblogs.microsoft.com/ise/wp-content/uploads/sites/55/2017/11/featured-1.png",
    "title": "Building a Custom Spark Connector for Near Real-Time Speech-to-Text Transcription - ISE Developer Blog",
    "description": "A Java client for the Azure Cognitive Services speech-to-text WebSocket protocol which enables near real-time transcription of English, French, Chinese..."
  },
  "https://runninginproduction.com/podcast/46-custom-hardware-to-provide-affordable-email-to-the-african-congo": {
    "image": "https://runninginproduction.com/assets/running-in-production-banner-a7b75aef66c413aae7a82b627cd5409eea27d1fd30419f36c1a6a8a33476f8b9.png",
    "title": "Custom Hardware to Provide Affordable Email to the African Congo",
    "description": "Clemens Wolff and Shaun Bathgate go over using Flask and an Orange Pi to build a hardware appliance. The server is hosted on Azure."
  },
  "https://www.podcastinit.com/lokole-with-clemens-wolff-episode-167/": {
    "image": "https://assets.podhome.fm/f6ff0caa-931b-4c08-bfdd-08dc7f5cd336/638525296494803510cover.jpg?1358743561",
    "title": "Bringing Africa Online At Ascoderu with Clemens Wolff",
    "description": "<h3>Summary</h3>\n<p>The future is here, it&#8217;s just not evenly distributed. One of the places where this is especially true is in sub-Saharan Africa…"
  },
  "https://www.youtube.com/watch?v=-ej6lf9RfBQ#t=20m40s": {
    "image": "https://i.ytimg.com/vi/-ej6lf9RfBQ/maxresdefault.jpg",
    "title": "#Code & Coffee – June 22, 2017",
    "description": ""
  }
}